/**
 * Палиндром — это когда строка или число одинаково читается
 * в прямом и обратном направлении:
 * - 121 — это палиндром.
 * - А роза упала на лапу Азора — тоже палиндром (если не считать заглавных букв).
 * - 12321 — и это палиндром.
 *
 * Проверяемые значения в тесте:
 * - "Довод" (кол-во проходов: 2).
 * - "Вывод" (кол-во проходов: 1).
 * - "Я с уколов - еле волокуся." (кол-во проходов: 12).
 *
 * Где количество проходов -- минимальное кол-во проходов цикла
 * для того чтобы убедиться что переданное значение является
 * палиндромом.
 */
module.exports.skillcheckPalyndrome = function (value) {
	let passed = false
	let iterations = 0

	// TODO: Необходимо реализовать.

	return [passed, iterations]
}
